Ruby_backend/app/controllers/api/events_controller.rb

    def set_event
      @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]